x11,y11,x21,y21=map(int,input().split()) #x11,y11 - левый верхний 1го,x21,y21 - правый нижний 1го
x12,y12,x22,y22=map(int,input().split()) #x12,y12 - левый верхний 2го,x22,y22 - правый нижний 2го
if x12>x21 or x22<x11 or y12>y21 or y22<y11::
    print('Прямоугольники лежат вне друг друга, не касаясь')
elif (y21==y12 and (x21<=x12-x11 or x11<=x22-x12)) or\
     (y11=y22 and (x11<=x22-x12 or x21<=x12-x11)) or\
     (x21==x12 and (y21<=y11-y21 or y22<=y11-y12)) or\
     (x22=x11 and (y11<=y12-y22 or y22<=y11-y21)):
    print('Прямоугольники имеют касание')
elif (y11>y12 and y21<y22 and x12>x11 and x22<x21) or\
     (y12>y11 and y22<y21 and x11>x12 and x21<x22):
    print('Один прямоугольник лежит внутри другого, не касаясь')
else:
    print('Прямоугольники имеют пересечение')
        
       
